puts '                                            Переменные'

# Переменне - это ссылки на ячейки памяти, куда мы можем что-то временно записать и при желании, изменить.

# Предпочтительно в программировании задавать переменные до блоков кода их обрабатывающих.

# 3 основные naming conventions:
# Snake case - между словами ставится знак подчеркивания underscore "_". Пример: user_password_expiration_date.
# Camel case - слово начинается с маленькой буквы, слова разделяются с помощью больших букв: userPasswordExpirationDate.
# Kebab case - слова разделяются дефисом: user-password-expiration-date.

# Переменным стоит давать осмысленные названия, чтобы понимать какие данные они обозначают

# Названия переменных лучше делать полностью уникальными, чтоб название одной переменной не было составной частью названия другой). Наример первая часть названия это к чему относится переменная, а вторая, что она делает.

# Все данные программы хранятся пока она работает, те они временные
