puts '                                             Scope'

# scope / область видимости - область в коде, в которой переменные и другие идентификаторы (например, функции или классы) доступны для использования. Это понятие определяет, где переменные могут быть определены и доступны, а также как они могут быть использованы в коде

# Понимание области видимости помогает избежать конфликтов имен и непреднамеренного изменения данных, а также управлять памятью и производительностью кода



puts '                                     Типы областей видимости'

# 1. Глобальная область видимости - переменные, объявленные в глобальной области, доступны из любого места в программе

# 2. Локальная область видимости - переменные, объявленные внутри функции или блока кода, доступны только внутри этого блока и недоступны за его пределами

# 3. Область видимости блока - в некоторых языках (например, JavaScript с `let` и `const`) переменные, объявленные внутри блока (например, внутри условного оператора или цикла), доступны только внутри этого блока

# 4. Замыкание (Closure) - это особый случай, когда функция имеет доступ к своей внешней функции (включая переменные) даже после того, как внешняя функция завершила выполнение















#
