//                                    Процедурная парадигма программирования

// Программа написанная в процедурном стиле ожидает на вход какие-то данные, выполняет ряд каких-то процедур или функций, после этого возвращает какой-то результат

// Например есть 2 переменные ширина и высота
const width = 5;
const height = 10;
// Есть функция/процедура, которая принимает эти ширину и высоту аргументами:
function calcRectArea(w, h) {
  return w * h;
}
console.log(calcRectArea(width, height)); //=> 59
// функция возвращает результат умножения принятых данных(ширины и высоты), те площадь

// Изначально все программы писались при помощи процедурного подхода, но потом стали слишком большими и стало сложно конфигурировать приложения, управлять сущьностями итд



//                                           Процедура и функция

// Процедура - это просто кусок/блок кода(подпрограмма), который чтото выполняет, набор заданных действий

// Функция имеет все свойства процедуры, но при этом чтото возвращает, например какоето значение, если его нет все равно будет возвращать например undefined(JS) nil(Ruby) итд










//
