puts '                                           WebSocket'

# WebSocket - это протокол, который позволяет устанавливать постоянное двухстороннее соединение между клиентом и сервером. В отличие от HTTP, где клиент должен постоянно отправлять запросы для получения данных, WebSocket позволяет серверу отправлять данные клиенту по мере их появления

# Характеристики WebSocket:
# 1. Постоянное соединение: соединение между клиентом и сервером не закрывается после ответа, как это происходит с HTTP.
# 2. Двусторонняя передача данных: клиент и сервер могут свободно обмениваться данными в реальном времени.
# 3. Использование: WebSocket подходит для приложений, требующих реального времени, таких как чаты, онлайн-игры, финансовые рынки.
