puts '                                           OBS Studio'

# https://obsproject.com - скачивание и установка на любые системы

# OBS Studio (Open Broadcaster Software) — это бесплатное программное обеспечение, для записи видео и трансляции.

# Установка на Линукс Убунту
# sudo apt install obs-studio



puts '                                    Настройка параметров записи'

# 1. Перейдите в "Настройки" > "Вывод"

# 2. Установите желаемый формат видео (рекомендуется MP4) и качество.

# 3. Проверьте настройки в разделе "Аудио", чтобы убедиться, что звук записывается правильно.



puts '                                      Настройка захвата окна'

# 1. Создайте новую сцену: В нижней части окна OBS в меню "Сцены" нажмите на кнопку "+" (Добавить), чтобы создать новую сцену. Выберите имя для новой сцены и нажмите "ОК".

# 2. Добавьте источник: В разделе "Источники" (находится рядом с "Сцены") нажмите на кнопку "+" (Добавить), чтобы добавить новый источник.

# 3. Выберите "Захват окна": В появившемся списке выберите "Захват окна" (или "Window Capture" на английском), чтобы захватить конкретное окно приложения.

# 4. Настройте источник, в открывшемся окне настройки выберите:
# а) Имя источника: Вы можете дать этому источнику любое имя, например "Терминал".
# б) Окно: В выпадающем списке выберите окно вашего терминала (например, "cmd", "PowerShell", "Terminal" для Linux и т. д.).
# в) При необходимости настройте другие параметры, такие как "Снять оформление окна" (если вы хотите убрать рамку вокруг окна).

# 5. Проверьте захват: Нажмите "ОК", и вы должны увидеть ваш терминал в окне предварительного просмотра OBS.

# 6. Настройте расположение и размер: Перетащите и измените размер захваченного окна на сцене, чтобы оно выглядело так, как вам нужно.



puts '                                            Запись видео'

# После настройки нажмите кнопку "Начать запись" в главном окне OBS.

# Чтобы остановить запись, просто нажмите "Остановить запись".















#
