puts '                                        Хранение данных'

# Существуют стандарты (форматы) для хранения данных - основная цель структурировать данные, чтобы былы единые правила для их обработки: чтобы сразу было понятно, где файл начинается, где хранится служебная информация, как в нём упакованы данные.

# Форматов и способов хранения данных много, например: XML, JSON и базы данных.


# Почему стоит избегать создания файлов с данными для программ руками, а стоит предпочитать програмную запись:
# Данные постоянно обновляются разными программами
# Файлы с данными могут содержать большие объемы информации, которые неудобно просматривать глазами
# Часто файлы, предназначенные для программ, вообще нельзя понять без дополнительных программ (JPEG, MP3, AVI)
# Многие форматы, например XML, изначально придуманы легко читаемымы и простымы по структуре именно для простоты его обработки в программах
# Человек может легко ошибиться в синтаксисе
